app/controllers/activations_controller.rb

SELECT "users".* FROM "users" WHERE (perishable_token = 'j7GX0uIdo6OUG46JVKd' and updated_at > '2011-02-08 03:56:16.292348') LIMIT 1
---
  def create
	  @user = User.find_using_perishable_token(params[:activation_code], 1.week) || (raise Exception)