app/controllers/emails_controller.rb

  def inbox
    #@email = Email.find(params[:username])
   # @emails = Email.find_by_username(params[:username])
     #@emails = Email.where("username = ?", params[:username])
    # @user = Email.where("username = ?", params[:username])
     #@emails = Email.paginate_by_user_id("#{@user.id}", :page => params[:page], :order => 'updated_at DESC', :per_page => 20)
    #@user_emails = Email.where("username = ?", params[:username])
    #@emails = Email.paginate_by_username("#{params[:username]}", :page => params[:page], :order => 'updated_at DESC', :per_page => 20)


    @user_emails = Email.where("username = ? and delete_flag = ?", params[:username], 0)
---
SELECT `emails`.* FROM `emails` WHERE (username = 'rehan1')

  def messages
        @email = Email.find_by_file_key(params[:file_key])
---
SELECT `emails`.* FROM `emails` WHERE (`emails`.`file_key` = 'home') LIMIT 1