app/controllers/password_resets_controller.rb

	def create
		@user = User.find_by_user_email(params[:email])
---
SELECT "users".* FROM "users" WHERE ("users"."user_email" = 'aforaslam@gmail.com') LIMIT 1

	def load_mailuser_using_perishable_token
		@user = User.where("perishable_token = ?", params[:id])
---
SELECT "users".* FROM "users" WHERE (perishable_token = 'm6US8dbCNR4C6Ybq')