app/controllers/users_controller.rb

INSERT INTO "users" ("username", "user_email", "fullname", "disk_quota", "crypted_password", "password_salt", "persistence_token", "single_access_token", "perishable_token", "last_request_at", "current_login_at", "last_login_at", "current_login_ip", "last_login_ip", "active", "created_at", "updated_at") VALUES ('aforaslam', 'aforaslam@gmail.com', 'Aslam Tajwala', NULL, 'de953f63bebc10757ba613e32b31ed22f0a75e8fa006ab2444eaa83087f6054a678cfb14978c55a565238f88e54df83fab08e6e585cee61af06bfe2a19c7670b', '3siCofYEOHDlMNVYI17', '6e4f15d07ce0858c270864c52d056d5f5264cca2e3b7babbbc466f9239f822d1c6638fe5b960d797de6d03d3b41e268e10fe4a09971f3bca4069c34e055be7e3', 'DLvgagd3prYgJLSUOTF', '1BqyRmwUq9VD75Iv8BG8', NULL, NULL, NULL, NULL, NULL, 'f', '2011-02-16 05:34:09.673767', '2011-02-16 05:34:09.673767')
---
  def create
    @user = User.new(params[:user])
    # Saving without session maintenance to skip
    # auto-login which can't happen here because
    # the user has not yet been activated
    if @user.save_without_session_maintenance and verify_recaptcha